html/elisp/introduction/operation-objects/window.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>窗口</title>
<meta name="author" content="Wu, Shanliang" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="../css/main.css" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="operation-objects.html"> UP </a>
 |
 <a accesskey="H" href="../elisp.html"> HOME </a>
</div><div id="content" class="content">
<h1 class="title">窗口</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgceb5fe5">分割窗口</a></li>
<li><a href="#orgcb8af9c">删除窗口</a></li>
<li><a href="#org2f34f9b">窗口配置</a>
<ul>
<li><a href="#org87fcd5a">窗口大小</a></li>
<li><a href="#org81b8b59">缓冲区</a></li>
<li><a href="#org72c1438">改变窗口显示区域</a></li>
</ul>
</li>
<li><a href="#org1ce1e99">选择窗口</a></li>
</ul>
</div>
</div>
<p>
<span class="underline">窗口</span> 是 <b>屏幕上用于显示一个缓冲区</b> 的部分，和它要区分开来的一个概念是 <span class="underline">frame</span> 。frame 是 <b>Emacs 能够使用屏幕的</b> 部分
</p>
<ul class="org-ul">
<li>一个 frame 里可以容纳多个（至少一个）窗口</li>
<li>而 Emacs 可以有多个 frame</li>
</ul>

<pre class="example" id="orgc90e9b9">
可能需要和通常所说的窗口的概念要区分开来，一般来说，我们所说的其它程序的窗口更类似于 Emacs 的一个 frame，所以也有人认为这里 window 译为窗格更好一些

但是窗格这个词是一个生造出来的词，还是用窗口比较顺一些，大家自己注意就行了
</pre>

<p>
在任何时候， 都有一个被选中的 frame，而在这个 frame 里有一个被选中的窗口，称为 <span class="underline">选择的窗口</span> （selected window）
</p>
<div id="outline-container-orgceb5fe5" class="outline-2">
<h2 id="orgceb5fe5">分割窗口</h2>
<div class="outline-text-2" id="text-orgceb5fe5">
<p>
刚启动时，emacs 都是只有一个 frame 一个窗口。多个窗口都是用 <span class="underline">分割窗口</span> 的函数生成的。分割窗口的内建函数是 <span class="underline">split-window</span> 。这个函数的参数如下：
</p>

<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #696969;">(</span>split-window <span style="color: #98fb98;">&amp;optional</span> window size horizontal<span style="color: #696969;">)</span>
</pre>
</div>

<p>
这个函数的功能是把当前或者指定窗口进行分割：
</p>
<ul class="org-ul">
<li>默认分割方式是 <span class="underline">水平分割</span> ，可以将参数中的 horizontal 设置为 non-nil 的值，变成垂直分割</li>
<li>如果不指定大小，则分割后两个窗口的大小是一样的</li>
</ul>

<p>
分割后的两个窗口里的缓冲区是 <b>同一个缓冲区</b> 。使用这个函数后， <b>光标仍然在原窗口</b> ，而返回的 <span class="underline">新窗口对象</span> ： 
</p>

<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #696969;">(</span>selected-window<span style="color: #696969;">)</span>                       <span style="color: #ff4500;">; =&gt; #&lt;window 136 on *scratch*&gt;</span>
<span style="color: #696969;">(</span>split-window<span style="color: #696969;">)</span>                          <span style="color: #ff4500;">; =&gt; #&lt;window 138 on *scratch*&gt;</span>
</pre>
</div>

<p>
窗口的分割也需要用 <b>树的结构</b> 来看分割后的窗口，比如这样一个过程：
</p>

<pre class="example" id="org8bc7ddb">
+---------------+         +---------------+
|               |         |      |        |
| win1          |         | win1 | win2   |
|               |   --&gt;   |      |        |
|               |         |      |        |
|               |         |      |        |
+---------------+         +---------------+
				 |
				 v
+---------------+         +---------------+
| win1   |      |         |       |       |
|        | win2 |         | win1  | win2  |
|--------|      |   &lt;--   |-------|       |
| 3 | 4  |      |         | win3  |       |
|   |    |      |         |       |       |
+---------------+         +---------------+
</pre>

<p>
可以看成是这样一种结构：
</p>
<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #696969;">(</span>win1<span style="color: #696969;">)</span> -&gt;  <span style="color: #696969;">(</span>win1 win2<span style="color: #696969;">)</span> -&gt; <span style="color: #696969;">((</span>win1 win3<span style="color: #696969;">)</span> win2<span style="color: #696969;">)</span> -&gt; <span style="color: #696969;">((</span>win1 <span style="color: #696969;">(</span>win3 win4<span style="color: #696969;">))</span> win2<span style="color: #696969;">)</span>
</pre>
</div>

<p>
事实上可以用 <span class="underline">window-tree</span> 函数得到当前窗口的结构，如果忽略 minibuffer 对应的窗口，得到的应该类似这样的一个结果：
</p>

<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #696969;">(</span>nil <span style="color: #696969;">(</span>0 0 170 42<span style="color: #696969;">)</span>
     <span style="color: #696969;">(</span>t <span style="color: #696969;">(</span>0 0 85 42<span style="color: #696969;">)</span>
        #&lt;win 3&gt;
        <span style="color: #696969;">(</span>nil <span style="color: #696969;">(</span>0 21 85 42<span style="color: #696969;">)</span> #&lt;win 8&gt; #&lt;win 10&gt;<span style="color: #696969;">))</span>
     #&lt;win 6&gt;<span style="color: #696969;">)</span>
</pre>
</div>

<p>
<span class="underline">window-tree</span> 返回值:
</p>
<ul class="org-ul">
<li>第一个元素代表 <span class="underline">子窗口的分割方式</span> ：
<ul class="org-ul">
<li><span class="underline">nil</span> :  <span class="underline">水平</span> 分割</li>
<li><span class="underline">t</span> : <span class="underline">垂直</span> 分割</li>
</ul></li>
<li>第二个元素代表 <span class="underline">整个结构的大小</span> 
<ul class="org-ul">
<li>这四个数字可以看作是 <span class="underline">左上</span> 和 <span class="underline">右下</span> 两个顶点的坐标</li>
</ul></li>
<li>其余元素是 <span class="underline">子窗口</span> 
<ul class="org-ul">
<li>每个子窗口也是同样的结构</li>
</ul></li>
</ul>

<p>
所以把前面这个列表还原成窗口排列应该是这样：
</p>
<pre class="example" id="org692dbef">
 (0,0) +-------------------+
       |         |         |
       | win 3   |  win6   |
       |         |         |
(0,21) |---------|         |
       |    |    |         |
       | 8  | 10 |         |
       |    |    |         |
       +-------------------+ (170, 42)
	       (85, 42)
</pre>

<p>
注意：由 window-tree 返回的结果一些窗口的大小不能确定， 比如：上面的 win 8 和 win 10 只能知道它们合并起来的大小，不能确定它们分别的宽度是多少
</p>
</div>
</div>

<div id="outline-container-orgcb8af9c" class="outline-2">
<h2 id="orgcb8af9c">删除窗口</h2>
<div class="outline-text-2" id="text-orgcb8af9c">
<ul class="org-ul">
<li>如果要让一个窗口不显示在屏幕上，要使用 <span class="underline">delete-window</span> 函数，删除的窗口多出来的空间会自动加到它的邻接的窗口中：
<ul class="org-ul">
<li>如果没有指定参数，删除的窗口是 <span class="underline">当前选中的窗口</span></li>
<li>如果指定了参数，删除的是 <span class="underline">这个参数对应的窗口</span></li>
</ul></li>
<li>如果要删除除了当前窗口之外的窗口，可以用 <span class="underline">delete-other-windows</span> 函数</li>
</ul>

<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #696969;">(</span>setq foo <span style="color: #696969;">(</span>selected-window<span style="color: #696969;">))</span>            <span style="color: #ff4500;">; =&gt; #&lt;window 90 on *scratch*&gt;</span>
<span style="color: #696969;">(</span>delete-window<span style="color: #696969;">)</span>
<span style="color: #696969;">(</span>windowp foo<span style="color: #696969;">)</span>                           <span style="color: #ff4500;">; =&gt; t</span>
<span style="color: #696969;">(</span>window-live-p foo<span style="color: #696969;">)</span>                     <span style="color: #ff4500;">; =&gt; nil</span>
</pre>
</div>

<p>
当一个窗口不可见之后，这个窗口对象也就消失了
</p>
</div>
</div>

<div id="outline-container-org2f34f9b" class="outline-2">
<h2 id="org2f34f9b">窗口配置</h2>
<div class="outline-text-2" id="text-org2f34f9b">
<p>
窗口配置包含了 frame 中所有窗口的位置信息：窗口 <span class="underline">大小</span> ， <span class="underline">显示的缓冲区</span> ，缓冲区中 <span class="underline">光标的位置</span> 和 <span class="underline">mark</span> ，还有 <span class="underline">fringe</span> ， <span class="underline">滚动条</span> 等等：
</p>
<ul class="org-ul">
<li>用 <span class="underline">current-window-configuration</span> 得到当前窗口配置</li>
<li>用 <span class="underline">set-window-configuration</span> 来还原</li>
</ul>
</div>

<div id="outline-container-org87fcd5a" class="outline-3">
<h3 id="org87fcd5a">窗口大小</h3>
<div class="outline-text-3" id="text-org87fcd5a">
<p>
窗口是一个 <b>长方形</b> 区域，所以窗口的大小信息包括它的 <span class="underline">高度</span> 和 <span class="underline">宽度</span> ，用来度量窗口大小的单位都是以 <span class="underline">字符数</span> 来表示
</p>

<pre class="example" id="orgc04bfc9">
窗口高度为 45 指的是这个窗口可以容纳 45 行字符，宽度为 140 是指窗口一行可以显示 140 个字符
</pre>

<p>
mode line 和 header line 都包含在窗口的高度里，所以有 <span class="underline">window-height</span> 和 <span class="underline">window-body-height</span> 两个函数，后者返回把 mode-line 和 header line 排除后 的高度 
</p>

<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #696969;">(</span>window-height<span style="color: #696969;">)</span>                         <span style="color: #ff4500;">; =&gt; 45</span>
<span style="color: #696969;">(</span>window-body-height<span style="color: #696969;">)</span>                    <span style="color: #ff4500;">; =&gt; 44</span>
</pre>
</div>
<p>
滚动条和 fringe 不包括在窗口的亮度里， <span class="underline">window-width</span> 返回窗口的宽度
</p>

<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #696969;">(</span>window-width<span style="color: #696969;">)</span>                          <span style="color: #ff4500;">; =&gt; 72</span>
</pre>
</div>
<p>
也可以用 <span class="underline">window-edges</span> 返回各个顶点的坐标信息，返回的位置信息包含了滚动条、fringe、mode line、header line 在内
</p>

<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #696969;">(</span>window-edges<span style="color: #696969;">)</span>                          <span style="color: #ff4500;">; =&gt; (0 0 73 45)</span>
</pre>
</div>

<p>
<span class="underline">window-inside-edges</span> 返回的就是窗口的文本区域的位置：
</p>

<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #696969;">(</span>window-inside-edges<span style="color: #696969;">)</span>                   <span style="color: #ff4500;">; =&gt; (1 0 73 44)</span>
</pre>
</div>

<p>
如果需要的话也可以得到用像素表示的窗口位置信息：
</p>

<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #696969;">(</span>window-pixel-edges<span style="color: #696969;">)</span>                    <span style="color: #ff4500;">; =&gt; (0 0 511 675)</span>
<span style="color: #696969;">(</span>window-inside-pixel-edges<span style="color: #696969;">)</span>             <span style="color: #ff4500;">; =&gt; (7 0 511 660)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org81b8b59" class="outline-3">
<h3 id="org81b8b59">缓冲区</h3>
<div class="outline-text-3" id="text-org81b8b59">
<p>
窗口对应的缓冲区可以用 <span class="underline">window-buffer</span> 函数得到：
</p>

<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #696969;">(</span>window-buffer<span style="color: #696969;">)</span>                         <span style="color: #ff4500;">; =&gt; #&lt;buffer *scratch*&gt;</span>
<span style="color: #696969;">(</span>window-buffer <span style="color: #696969;">(</span>next-window<span style="color: #696969;">))</span>           <span style="color: #ff4500;">; =&gt; #&lt;buffer *info*&gt;</span>
</pre>
</div>

<ul class="org-ul">
<li>缓冲区对应的窗口也可以用 <span class="underline">get-buffer-window</span> 得到
<ul class="org-ul">
<li>如果有多个窗口显示同一 个缓冲区，那这个函数只能返回其中的一个，由window-list决定</li>
</ul></li>
<li>如果要得到所有的窗口，可以用 <span class="underline">get-buffer-window-list</span></li>
</ul>

<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #696969;">(</span>get-buffer-window <span style="color: #696969;">(</span>get-buffer <span style="color: #ffa07a;">"*scratch*"</span><span style="color: #696969;">))</span>
<span style="color: #ff4500;">;; </span><span style="color: #ff4500;">=&gt; #&lt;window 268 on *scratch*&gt;</span>
<span style="color: #696969;">(</span>get-buffer-window-list <span style="color: #696969;">(</span>get-buffer <span style="color: #ffa07a;">"*scratch*"</span><span style="color: #696969;">))</span>
<span style="color: #ff4500;">;; </span><span style="color: #ff4500;">=&gt; (#&lt;window 268 on *scratch*&gt; #&lt;window 270 on *scratch*&gt;)</span>
</pre>
</div>

<ul class="org-ul">
<li>让某个窗口显示某个缓冲区可以用 <span class="underline">set-window-buffer</span> 函数</li>
<li>让选中窗口显示某个缓冲区也可以用 <span class="underline">switch-to-buffer</span></li>
</ul>

<pre class="example" id="org0dc9ecc">
但是一般不要在 elisp 编程中用 switch-to-buffer 

如果需要让某个缓冲区成为当前缓冲区使用 set-buffer 函数

如果要让当前窗口显示某个缓冲区，使用 set-window-buffer 函数 
</pre>

<ul class="org-ul">
<li>让一个缓冲区可见可以用 display-buffer。默认的行为：
<ul class="org-ul">
<li>当缓冲区已经显示在某个窗口中时：
<ul class="org-ul">
<li>如果不是当前选中窗口，则返回那个窗口</li>
<li>如果是当前选中窗口， 且如果传递的 not-this-window 参数为 non-nil 时，会新建一个窗口，显示缓冲区</li>
</ul></li>
<li>如果没有任何窗口显示这个缓冲区，则新建一个窗口显示缓冲区，并返回这个窗口</li>
</ul></li>
</ul>

<pre class="example" id="org4fb6061">
display-buffer 是一个比较高级的命令，用户可以通过一些变量来改变这个命令的行为，具体可以查找文档

如果这些还不能满足你的要求，还可以自己写一个函数，将 display-buffer-function 设置成这个函数
</pre>
</div>
</div>

<div id="outline-container-org72c1438" class="outline-3">
<h3 id="org72c1438">改变窗口显示区域</h3>
<div class="outline-text-3" id="text-org72c1438">
<p>
每个窗口会保存一个 <b>显示缓冲区的起点位置</b> ，这个位置对应于窗口 <span class="underline">左上角光标</span> 在 <span class="underline">缓冲区</span> 里的 <span class="underline">位置</span> ：
</p>
<ul class="org-ul">
<li>用 <span class="underline">window-start</span> 函数得到某个窗口的起点位置</li>
<li>通过 <span class="underline">set-window-start</span> 来改变显示起点位置</li>
<li>可以 <span class="underline">pos-visible-in-window-p</span> 来检测缓冲区中某个位置是否是可见的</li>
</ul>

<pre class="example" id="orged96a5c">
但是直接通过 set-window-start 来控制显示比较容易出现错误，因为 set-window-start 并不会改变 point 所在的位置，在窗口调用 redisplay 函数之后 point 会跳到相应的位置

如果你确实有这个需要，建议还是用： (with-selected-window window (goto-char pos)) 来代替
</pre>
</div>
</div>
</div>

<div id="outline-container-org1ce1e99" class="outline-2">
<h2 id="org1ce1e99">选择窗口</h2>
<div class="outline-text-2" id="text-org1ce1e99">
<p>
可以用 <span class="underline">selected-window</span> 得到当前光标所在的窗口
</p>

<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #696969;">(</span>selected-window<span style="color: #696969;">)</span>                       <span style="color: #ff4500;">; =&gt; #&lt;window 104 on *scratch*&gt;</span>
</pre>
</div>


<p>
用 <span class="underline">select-window</span> 函数使某个窗口变成选中的窗口
</p>

<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #696969;">(</span><span style="color: #00ffff;">progn</span>
  <span style="color: #696969;">(</span>setq foo <span style="color: #696969;">(</span>selected-window<span style="color: #696969;">))</span>
  <span style="color: #696969;">(</span>message <span style="color: #ffa07a;">"Original window: %S"</span> foo<span style="color: #696969;">)</span>
  <span style="color: #696969;">(</span>other-window 1<span style="color: #696969;">)</span>
  <span style="color: #696969;">(</span>message <span style="color: #ffa07a;">"Current window: %S"</span> <span style="color: #696969;">(</span>selected-window<span style="color: #696969;">))</span>
  <span style="color: #696969;">(</span>select-window foo<span style="color: #696969;">)</span>
  <span style="color: #696969;">(</span>message <span style="color: #ffa07a;">"Back to original window: %S"</span> foo<span style="color: #696969;">))</span>
</pre>
</div>

<p>
两个特殊的宏可以保存窗口位置执行语句，它们的作用是在 <span class="underline">执行语句结束</span> 后 <span class="underline">选择的窗口</span> 仍留在 <span class="underline">执行语句之前的窗口</span> ：
</p>
<ul class="org-ul">
<li>save-selected-window：可以选择其它窗口</li>
<li>with-selected-window: 选择当前的窗口</li>
</ul>

<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #ff4500;">;; </span><span style="color: #ff4500;">&#35753;&#21478;&#19968;&#20010;&#31383;&#21475;&#28378;&#21160;&#21040;&#32531;&#20914;&#21306;&#24320;&#22987;</span>
<span style="color: #696969;">(</span>save-selected-window
  <span style="color: #696969;">(</span>select-window <span style="color: #696969;">(</span>next-window<span style="color: #696969;">))</span>
  <span style="color: #696969;">(</span>goto-char <span style="color: #696969;">(</span>point-min<span style="color: #696969;">)))</span>
</pre>
</div>

<pre class="example" id="org1d5db08">
这两个宏不会保存窗口的位置信息，如果执行语句结束后，保存的窗口已经消失，则会选择最后一个选择的窗口
</pre>

<p>
当前 frame 里所有的窗口可以用 <span class="underline">window-list</span> 函数得到
</p>
<ul class="org-ul">
<li>用 <span class="underline">next-window</span> 来得到在 window-list 里排在某个 window 之后的窗口</li>
<li>用 <span class="underline">previous-window</span> 得到排在某个 window 之前的窗口</li>
</ul>

<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #696969;">(</span>selected-window<span style="color: #696969;">)</span>                       <span style="color: #ff4500;">; =&gt; #&lt;window 245 on *scratch*&gt;</span>
<span style="color: #696969;">(</span>window-list<span style="color: #696969;">)</span>
<span style="color: #ff4500;">;; </span><span style="color: #ff4500;">=&gt; (#&lt;window 245 on *scratch*&gt; #&lt;window 253 on *scratch*&gt; #&lt;window 251 on *info*&gt;)</span>
<span style="color: #696969;">(</span>next-window<span style="color: #696969;">)</span>                           <span style="color: #ff4500;">; =&gt; #&lt;window 253 on *scratch*&gt;</span>
<span style="color: #696969;">(</span>next-window <span style="color: #696969;">(</span>next-window<span style="color: #696969;">))</span>             <span style="color: #ff4500;">; =&gt; #&lt;window 251 on *info*&gt;</span>
<span style="color: #696969;">(</span>next-window <span style="color: #696969;">(</span>next-window <span style="color: #696969;">(</span>next-window<span style="color: #696969;">)))</span> <span style="color: #ff4500;">; =&gt; #&lt;window 245 on *scratch*&gt;</span>
</pre>
</div>

<ul class="org-ul">
<li><span class="underline">walk-windows</span> 可以遍历窗口，相当于 <span class="underline">(mapc proc (window-list))</span></li>
<li><span class="underline">get-window-with-predicate</span> 用于查找符合某个条件的窗口</li>
</ul>

<p>
<a href="file.html">Next：文件</a>
</p>

<p>
<a href="window.html">Previous：窗口</a>
</p>

<p>
<a href="operation-objects.html">TOP：操作对象</a>
</p>
</div>
</div>
</div>
<div id="postamble" class="status">

		  <br/>
		  <div class='ds-thread'></div>
		  <script>
		  var duoshuoQuery = {short_name:'klose911'};
		  (function() {
					  var dsThread = document.getElementsByClassName('ds-thread')[0];
					  dsThread.setAttribute('data-thread-key', document.title);
					  dsThread.setAttribute('data-title', document.title);
					  dsThread.setAttribute('data-url', window.location.href);
					  var ds = document.createElement('script');
					  ds.type = 'text/javascript';ds.async = true;
					  ds.src = (document.location.protocol == 'https:' ? 'https:' : 'http:') + '//static.duoshuo.com/embed.js';
					  ds.charset = 'UTF-8';
					  (document.getElementsByTagName('head')[0] 
						|| document.getElementsByTagName('body')[0]).appendChild(ds);
					  })();
		  </script>
		  <script>
		  (function(i,s,o,g,r,a,m){i['GoogleAnalyticsObject']=r;i[r]=i[r]||function(){
			(i[r].q=i[r].q||[]).push(arguments)},i[r].l=1*new Date();a=s.createElement(o),
			m=s.getElementsByTagName(o)[0];a.async=1;a.src=g;m.parentNode.insertBefore(a,m)
			})(window,document,'script','https://www.google-analytics.com/analytics.js','ga');
		  ga('create', 'UA-90850421-1', 'auto');
		  ga('send', 'pageview');
		  </script>
</div>
</body>
</html>
